openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
/* -------------------------------- Arctic Core ------------------------------
 * Arctic Core - the open source AUTOSAR platform http://arccore.com
 *
 * Copyright (C) 2009  ArcCore AB <contact@arccore.com>
 *
 * This source code is free software; you can redistribute it and/or modify it
 * under the terms of the GNU General Public License version 2 as published by the
 * Free Software Foundation; See <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 * for more details.
 * -------------------------------- Arctic Core ------------------------------*/


#include "Can.h"
#include "mpc55xx.h"
#include "Cpu.h"
#include "Mcu.h"
#include "CanIf_Cbk.h"
#include "Det.h"
#if defined(USE_DEM)
#include "Dem.h"
#endif
#include <assert.h>
#include <stdlib.h>
#include <string.h>
#include "Os.h"
#include "isr.h"
#include "irq.h"
#include "arc.h"



/* CONFIGURATION NOTES
 * ------------------------------------------------------------------
 * - CanHandleType must be CAN_ARC_HANDLE_TYPE_BASIC
 *   i.e. CanHandleType=CAN_ARC_HANDLE_TYPE_FULL NOT supported
 *   i.e CanIdValue is NOT supported
 * - All CanXXXProcessing must be CAN_ARC_PROCESS_TYPE_INTERRUPT
 *   ie CAN_ARC_PROCESS_TYPE_POLLED not supported
 * - To select the Mailboxes to use in the CAN controller use Can_Arc_MbMask
 * - HOH's for Tx are global and Rx are for each controller
 * - CanControllerTimeQuanta is NOT used. The other CanControllerXXX selects
 *   the proper time-quanta
 * - Can_Arc_MbMask for Tx HOH must NOT overlap Can_Arc_MbMask for Rx.
 * - ONLY global mask is supported( NOT 14,15 and individual )
 * - Numbering the CanObjectId for Tx:
 *     To do this correctly there are a number of things that are good to know
 *     1. HTH's have unique numbers.
 *     2. One HTH/HRH is maped to one HOH
 *     3. The extension Can_Arc_MbMask binds FULL CAN boxes together.
 *
 *     Example:
 *
 *     HTH   B/F C  HOH
 *     ---------------------
 *      0    F   0  0
 *      1    F   0  1
 *      ..
 *      16   B   0  16  |
 *                  17  |    The use of Can_Arc_MbMask=0x000f0000 binds these to HTH 16
 *                  18  |    ( bits 16 to 19 set here )
 *                  19  |
 *           ...
 *      32   ... 1  32
 *
 *
 *        B - BASIC CAN
 *        F - FULL CAN
 *        C - Controller number
 *
 */

/* IMPLEMENTATION NOTES
 * -----------------------------------------------
 * - A HOH us unique for a controller( not a config-set )
 * - Hrh's are numbered for each controller from 0
 * - HOH is numbered for each controller in sequences of 0-31
 *   ( since we have 6 controllers and Hth is only uint8( See Can_Write() proto )
 * - loopback in HW NOT supported
 * - 32 of 64 boxes supported ( limited by Hth type )
  * - Fifo in HW NOT supported
 */

/* ABBREVATIONS
 *  -----------------------------------------------
 * - Can Hardware unit - One or multiple Can controllers of the same type.
 * - Hrh - HOH with receive definitions
 * - Hth - HOH with transmit definitions
 *
 */

/* HW INFO
 * ------------------------------------------------------------------
 *   This controller should really be called FlexCan+ or something because
 *   it's enhanced with:
 *   - A RX Fifo !!!!! ( yep, it's fantastic ;) )
 *   - A better matching process. From 25.4.4
 *   "By programming	more than one MB with the same ID, received messages will
 *    be queued into the MBs. The CPU can examine the time stamp field of the
 *    MBs to determine the order in which the messages arrived."
 *
 *   Soo, now it seems that Freescale have finally done something right.
 */

//-------------------------------------------------------------------

// Number of mailboxes used for each controller ( power of 2 only )
// ( It's NOT supported to set this to 64 )
#define MAX_NUM_OF_MAILBOXES 32

#if defined(CFG_MPC5567)
#define GET_CONTROLLER(_controller) 	\
        					((struct FLEXCAN2_tag *)(0xFFFC0000 + 0x4000*(_controller)))
#else
#define GET_CONTROLLER(_controller) 	\
        					((struct FLEXCAN_tag *)(0xFFFC0000 + 0x4000*(_controller)))
#endif

#define GET_CONTROLLER_CONFIG(_controller)	\
        					&Can_Global.config->CanConfigSet->CanController[(_controller)]

#define GET_CALLBACKS() \
							(Can_Global.config->CanConfigSet->CanCallbacks)

#define GET_PRIVATE_DATA(_controller) \
									&CanUnit[_controller]

#define GET_CONTROLLER_CNT() (CAN_CONTROLLER_CNT)

#define INSTALL_HANDLER4(_name, _can_entry, _vector, _priority, _app)\
	do { \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+0, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+1, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+2, _priority, _app); \
		ISR_INSTALL_ISR2(_name, _can_entry, _vector+3, _priority, _app); \
	} while(0)

#define INSTALL_HANDLER16(_name, _can_entry, _vector, _priority, _app)\
	do { \
		INSTALL_HANDLER4(_name, _can_entry, _vector+0, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+4, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+8, _priority, _app); \
		INSTALL_HANDLER4(_name, _can_entry, _vector+12,_priority, _app); \
	} while(0)


//-------------------------------------------------------------------

#if ( CAN_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return CAN_NOT_OK; \
        }

#define VALIDATE_NO_RV(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(MODULE_ID_CAN,0,_api,_err); \
          return; \
        }

#define DET_REPORTERROR(_x,_y,_z,_q) Det_ReportError(_x, _y, _z, _q)
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_NO_RV(_exp,_api,_err )
#define DET_REPORTERROR(_x,_y,_z,_q)
#endif

#if defined(USE_DEM)
#define VALIDATE_DEM_NO_RV(_exp,_err ) \
        if( !(_exp) ) { \
          Dem_ReportErrorStatus(_err, DEM_EVENT_STATUS_FAILED); \
          return; \
        }
#else
#define VALIDATE_DEM_NO_RV(_exp,_err )
#endif

//-------------------------------------------------------------------

