openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
// Uses 25.4.5.1 Transmission Abort Mechanism
static void Can_AbortTx( flexcan_t *canHw, Can_UnitType *canUnit ) {
  uint32 mbMask;
  uint8 mbNr;

	// Find our Tx boxes.
  mbMask = canUnit->Can_Arc_TxMbMask;

  // Loop over the Mb's set to abort
  for (; mbMask; mbMask&=~(1<<mbNr)) {
    mbNr = ilog2(mbMask);

    canHw->BUF[mbNr].CS.B.CODE = MB_ABORT;

    // Did it take
    if( canHw->BUF[mbNr].CS.B.CODE != MB_ABORT ) {
			// nope..

    	// it's not sent... or being sent.
    	// Just wait for it
      int i = 0;
    	while( canHw->IFRL.R == (1<<mbNr) )
    	{
    	  i++;
    	  if (i > 1000)
    	    break;
    	}
    }
  }

  // Ack tx interrupts
  canHw->IFRL.R = canUnit->Can_Arc_TxMbMask;
  canUnit->iflagStart = canUnit->Can_Arc_TxMbMask;
}

//-------------------------------------------------------------------

/**
 * BussOff ISR for CAN
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_BusOff( int unit ) {
  flexcan_t *canHw = GET_CONTROLLER(unit);
  Can_UnitType *canUnit = GET_PRIVATE_DATA(unit);
  Can_Arc_ErrorType err;
  err.R = 0;

  if ( canHw->ESR.B.TWRNINT )
  {
    err.B.TXWRN = canHw->ESR.B.TXWRN;
    canUnit->stats.txErrorCnt++;
    canHw->ESR.B.TWRNINT = 1;
  }

  if ( canHw->ESR.B.RWRNINT )
  {
    err.B.RXWRN = canHw->ESR.B.RXWRN;
    canUnit->stats.rxErrorCnt++;
    canHw->ESR.B.RWRNINT = 1;
  }

  if (err.R != 0)
  {
    if (GET_CALLBACKS()->Arc_Error != NULL)
    {
      GET_CALLBACKS()->Arc_Error( unit, err );
    }
  }

  if( canHw->ESR.B.BOFFINT ) {

    canUnit->stats.boffCnt++;
    if (GET_CALLBACKS()->ControllerBusOff != NULL)
    {
      GET_CALLBACKS()->ControllerBusOff(unit);
    }
    Can_SetControllerMode(unit, CAN_T_STOP); // CANIF272

    canHw->ESR.B.BOFFINT = 1;

    Can_AbortTx( canHw, canUnit ); // CANIF273
  }
}

//-------------------------------------------------------------------

/**
 * ISR for CAN. Normal Rx/Tx operation
 *
 * @param unit CAN controller number( from 0 )
 */
static void Can_Isr(int unit) {

  flexcan_t *canHw= GET_CONTROLLER(unit);
  const Can_ControllerConfigType *canHwConfig= GET_CONTROLLER_CONFIG(Can_Global.channelMap[unit]);
  uint32 iFlagLow = canHw->IFRL.R;
  Can_UnitType *canUnit = GET_PRIVATE_DATA(unit);

  // Read interrupt flags to seeTxConfirmation what interrupt triggered the interrupt
  if (iFlagLow & canHw->IMRL.R) {
    // Check FIFO

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
  	// Note!
  	//   FIFO code NOT tested
    if (canHw->MCR.B.FEN) {

      // Check overflow
      if (iFlagLow & (1<<7)) {
        canUnit->stats.fifoOverflow++;
        canHw->IFRL.B.BUF07I = 1;
      }

      // Check warning
      if (iFlagLow & (1<<6)) {
        canUnit->stats.fifoWarning++;
        canHw->IFRL.B.BUF06I = 1;
      }

      // Pop fifo "realtime"
      while (canHw->IFRL.B.BUF05I) {
        // At
        // TODO MAHI: Must read the entire data-buffer to unlock??
      	if (GET_CALLBACKS()->RxIndication != NULL)
        {
          GET_CALLBACKS()->RxIndication((-1), canHw->BUF[0].ID.B.EXT_ID,
            canHw->BUF[0].CS.B.LENGTH, (uint8 *)&canHw->BUF[0].DATA.W[0] );
        }
        // Clear the interrupt
        canHw->IFRL.B.BUF05I = 1;
      }
    } else
#endif
    {

      // No FIFO used
      const Can_HardwareObjectType *hohObj;
      uint32 mbMask;
      uint8 mbNr = 0;
      uint32 data;
      Can_IdType id;

      //
      // Loop over all the Hoh's
      //

      // Rx
      hohObj= canHwConfig->Can_Arc_Hoh;
      --hohObj;
      do {
        ++hohObj;

        mbMask = hohObj->Can_Arc_MbMask & iFlagLow;

        if (hohObj->CanObjectType == CAN_OBJECT_TYPE_RECEIVE)
        {
          // Loop over the Mb's for this Hoh
          for (; mbMask; mbMask&=~(1<<mbNr)) {
            mbNr = ilog2(mbMask);

            // Do the necessary dummy reads to keep controller happy
            data = canHw->BUF[mbNr].CS.R;
            data = canHw->BUF[mbNr].DATA.W[0];

            // According to autosar MSB shuould be set if extended
            if (hohObj->CanIdType == CAN_ID_TYPE_EXTENDED) {
              id = canHw->BUF[mbNr].ID.R;
              id |= 0x80000000;
            } else {
              id = canHw->BUF[mbNr].ID.B.STD_ID;
            }

            if (GET_CALLBACKS()->RxIndication != NULL)
            {
              GET_CALLBACKS()->RxIndication(hohObj->CanObjectId,
                                            id,
                                            canHw->BUF[mbNr].CS.B.LENGTH,
                                            (uint8 *)&canHw->BUF[mbNr].DATA.W[0] );
            }
            // Increment statistics
            canUnit->stats.rxSuccessCnt++;

            // unlock MB (dummy read timer)
            (void)canHw->TIMER.R;

            // Clear interrupt
            canHw->IFRL.R = (1<<mbNr);
          }
        }
      } while ( !hohObj->Can_Arc_EOL);

      // Tx
      hohObj= canHwConfig->Can_Arc_Hoh;
      --hohObj;
      do {
        ++hohObj;

        if (hohObj->CanObjectType == CAN_OBJECT_TYPE_TRANSMIT)
        {
          mbMask = hohObj->Can_Arc_MbMask & iFlagLow;

          // Loop over the Mb's for this Hoh
          for (; mbMask; mbMask&=~(1<<mbNr)) {
            mbNr = ilog2(mbMask);

            if (GET_CALLBACKS()->TxConfirmation != NULL)
            {
              GET_CALLBACKS()->TxConfirmation(canUnit->swPduHandles[mbNr]);
            }
            canUnit->swPduHandles[mbNr] = 0;  // Is this really necessary ??

            // Clear interrupt
            canUnit->iflagStart |= (1<<mbNr);
            canHw->IFRL.R = (1<<mbNr);
          }
        }
      } while ( !hohObj->Can_Arc_EOL);
    } // FIFO code
  } else {
    // Note! Over 32 boxes is not implemented
    // Other reasons that we end up here
    // - Interupt on a masked box
  }

