openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Can.c
  canUnit->iflagStart = canUnit->Can_Arc_TxMbMask;

  canUnit->state = CANIF_CS_STOPPED;
  Can_EnableControllerInterrupts(cId);

  return;
}


Can_ReturnType Can_SetControllerMode( uint8 controller, Can_StateTransitionType transition ) {
  flexcan_t *canHw;
  Can_ReturnType rv = CAN_OK;
  VALIDATE( (controller < GET_CONTROLLER_CNT()), 0x3, CAN_E_PARAM_CONTROLLER );

  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE( (canUnit->state!=CANIF_CS_UNINIT), 0x3, CAN_E_UNINIT );
  canHw = GET_CONTROLLER(controller);

  switch(transition )
  {
  case CAN_T_START:
    canHw->MCR.B.FRZ = 0;
    canHw->MCR.B.HALT = 0;
    canUnit->state = CANIF_CS_STARTED;
    imask_t state = McuE_EnterCriticalSection();
    if (canUnit->lock_cnt == 0)   // REQ CAN196
    {
      Can_EnableControllerInterrupts(controller);
    }
    McuE_ExitCriticalSection(state);
    break;
  case CAN_T_WAKEUP:  //CAN267
  case CAN_T_SLEEP:  //CAN258, CAN290
    // Should be reported to DEM but DET is the next best
    VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
  case CAN_T_STOP:
    // Stop
    canHw->MCR.B.FRZ = 1;
    canHw->MCR.B.HALT = 1;
    canUnit->state = CANIF_CS_STOPPED;
    Can_AbortTx( canHw, canUnit ); // CANIF282
    break;
  default:
    // Should be reported to DEM but DET is the next best
    VALIDATE(canUnit->state == CANIF_CS_STOPPED, 0x3, CAN_E_TRANSITION);
    break;
  }

  return rv;
}

void Can_DisableControllerInterrupts( uint8 controller )
{
  Can_UnitType *canUnit;
  flexcan_t *canHw;

  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x4, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x4, CAN_E_UNINIT );

  imask_t state = McuE_EnterCriticalSection();
  if(canUnit->lock_cnt > 0 )
  {
    // Interrupts already disabled
    canUnit->lock_cnt++;
    McuE_ExitCriticalSection(state);
    return;
  }
  canUnit->lock_cnt++;
  McuE_ExitCriticalSection(state);

  /* Don't try to be intelligent, turn everything off */
  canHw = GET_CONTROLLER(controller);

  /* Turn off the interrupt mailboxes */
  canHw->IMRH.R = 0;
  canHw->IMRL.R = 0;

  /* Turn off the bus off/tx warning/rx warning and error */
  canHw->MCR.B.WRNEN = 0;  	/* Disable warning int */
  canHw->CR.B.ERRMSK = 0;  	/* Disable error interrupt */
  canHw->CR.B.BOFFMSK = 0; 	/* Disable bus-off interrupt */
  canHw->CR.B.TWRNMSK = 0;	/* Disable Tx warning */
  canHw->CR.B.RWRNMSK = 0;	/* Disable Rx warning */
}

void Can_EnableControllerInterrupts( uint8 controller ) {
  Can_UnitType *canUnit;
  flexcan_t *canHw;
  const Can_ControllerConfigType *canHwConfig;
  VALIDATE_NO_RV( (controller < GET_CONTROLLER_CNT()), 0x5, CAN_E_PARAM_CONTROLLER );

  canUnit = GET_PRIVATE_DATA(controller);

  VALIDATE_NO_RV( (canUnit->state!=CANIF_CS_UNINIT), 0x5, CAN_E_UNINIT );

  imask_t state = McuE_EnterCriticalSection();
  if( canUnit->lock_cnt > 1 )
  {
    // IRQ should still be disabled so just decrement counter
    canUnit->lock_cnt--;
    McuE_ExitCriticalSection(state);
    return;
  } else if (canUnit->lock_cnt == 1)
  {
    canUnit->lock_cnt = 0;
  }
  McuE_ExitCriticalSection(state);

  canHw = GET_CONTROLLER(controller);

  canHwConfig = GET_CONTROLLER_CONFIG(Can_Global.channelMap[controller]);

  canHw->IMRH.R = 0;
  canHw->IMRL.R = 0;

  if( canHwConfig->CanRxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    /* Turn on the interrupt mailboxes */
    canHw->IMRL.R = canUnit->Can_Arc_RxMbMask;
  }

  if( canHwConfig->CanTxProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    /* Turn on the interrupt mailboxes */
    canHw->IMRL.R |= canUnit->Can_Arc_TxMbMask;
  }

  // BusOff here represents all errors and warnings
  if( canHwConfig->CanBusOffProcessing == CAN_ARC_PROCESS_TYPE_INTERRUPT ) {
    canHw->MCR.B.WRNEN = 1;  	/* Turn On warning int */

    canHw->CR.B.ERRMSK = 1;  	/* Enable error interrupt */
    canHw->CR.B.BOFFMSK = 1; 	/* Enable bus-off interrupt */
    canHw->CR.B.TWRNMSK = 1;	/* Enable Tx warning */
    canHw->CR.B.RWRNMSK = 1;	/* Enable Rx warning */
  }

  return;
}

Can_ReturnType Can_Write( Can_Arc_HTHType hth, Can_PduType *pduInfo ) {
  uint16_t timer;
  uint32_t iflag;
  Can_ReturnType rv = CAN_OK;
  uint32_t mbNr;
  flexcan_t *canHw;
  const Can_HardwareObjectType *hohObj;
  uint32 controller;
  uint32 oldMsr;

  VALIDATE( (Can_Global.initRun == CAN_READY), 0x6, CAN_E_UNINIT );
  VALIDATE( (pduInfo != NULL), 0x6, CAN_E_PARAM_POINTER );
  VALIDATE( (pduInfo->length <= 8), 0x6, CAN_E_PARAM_DLC );
  VALIDATE( (hth < NUM_OF_HTHS ), 0x6, CAN_E_PARAM_HANDLE );

  hohObj = Can_FindHoh(hth, &controller);
  if (hohObj == NULL)
    return CAN_NOT_OK;

  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);

  canHw = GET_CONTROLLER(controller);
  oldMsr = McuE_EnterCriticalSection();
  iflag = canHw->IFRL.R & canUnit->Can_Arc_TxMbMask;

  // check for any free box
  // Normally we would just use the iflag to get the free box
  // but that does not work the first time( iflag == 0 ) so we
  // create one( iflagStart )
  if( iflag | canUnit->iflagStart ) {
    mbNr =  ilog2((iflag | canUnit->iflagStart));	// find mb number
    // clear flag
    canHw->IFRL.R = (1<<mbNr);
    canUnit->iflagStart &= ~(1<<mbNr);

    // Setup message box type
    if( hohObj->CanIdType == CAN_ID_TYPE_EXTENDED ) {
      canHw->BUF[mbNr].CS.B.IDE = 1;
    } else if ( hohObj->CanIdType == CAN_ID_TYPE_STANDARD ) {
      canHw->BUF[mbNr].CS.B.IDE = 0;
    } else {
      // No support for mixed in this processor
      assert(0);
    }

    // Send on buf
    canHw->BUF[mbNr].CS.B.CODE = MB_INACTIVE;	// Hold the transmit buffer inactive
    if( hohObj->CanIdType == CAN_ID_TYPE_EXTENDED ) {
      canHw->BUF[mbNr].ID.R = pduInfo->id; // Write 29-bit MB IDs
    } else {
      assert( !(pduInfo->id & 0xfffff800) );
      canHw->BUF[mbNr].ID.B.STD_ID = pduInfo->id;
    }

#if defined(CFG_MPC5516) || defined(CFG_MPC5517) || defined(CFG_MPC5606S)
    canHw->BUF[mbNr].ID.B.PRIO = 1; 			// Set Local Priority
#endif

    memset(&canHw->BUF[mbNr].DATA, 0, 8);
    memcpy(&canHw->BUF[mbNr].DATA, pduInfo->sdu, pduInfo->length);

    canHw->BUF[mbNr].CS.B.SRR = 1;
    canHw->BUF[mbNr].CS.B.RTR = 0;

    canHw->BUF[mbNr].CS.B.LENGTH = pduInfo->length;
    canHw->BUF[mbNr].CS.B.CODE = MB_TX_ONCE;			// Write tx once code
    timer = canHw->TIMER.R; 						// Unlock Message buffers

    canUnit->stats.txSuccessCnt++;

    // Store pdu handle in unit to be used by TxConfirmation
    canUnit->swPduHandles[mbNr] = pduInfo->swPduHandle;

  } else {
    rv = CAN_BUSY;
  }
  McuE_ExitCriticalSection(oldMsr);

  return rv;
}

void Can_MainFunction_Read( void ) {

	/* NOT SUPPORTED */
}

void Can_MainFunction_BusOff( void ) {
  /* Bus-off polling events */

	/* NOT SUPPORTED */
}

void Can_MainFunction_Wakeup( void ) {
  /* Wakeup polling events */

	/* NOT SUPPORTED */
}


/**
 * Get send/receive/error statistics for a controller
 *
 * @param controller The controller
 * @param stats Pointer to data to copy statistics to
 */

void Can_Arc_GetStatistics( uint8 controller, Can_Arc_StatisticsType *stats)
{
  Can_UnitType *canUnit = GET_PRIVATE_DATA(controller);
  *stats = canUnit->stats;
}



